
//POSIX
#include <termios.h>
#include <unistd.h>
#include <signal.h>

// i2c library
#include "i2c-dev.h"

// C library
#include <stdio.h>
#include <stdlib.h>

// C++ library
#include <iostream>
#include <cstdio>
#include <cstdlib>
#include <cstring>

// Camera library
#include <sys/stat.h>
#include <sys/types.h>
#include <sys/time.h>
#include <sys/mman.h>
#include <sys/ioctl.h>
#include <linux/videodev2.h>

// Boost C++

//
#include <boost/bind.hpp>

//
#include <boost/shared_ptr.hpp>
#include <boost/enable_shared_from_this.hpp>

//
#include <boost/asio/serial_port.hpp>
#include <boost/asio.hpp>

//
#include <boost/circular_buffer.hpp>

//
#include <boost/thread.hpp>
#include <boost/thread/thread.hpp>

//
#include <boost/atomic.hpp>

//
#include <boost/accumulators/accumulators.hpp>
#include <boost/accumulators/statistics/stats.hpp>
#include <boost/accumulators/statistics/mean.hpp>
#include <boost/accumulators/statistics/moment.hpp>
#include <boost/accumulators/statistics/median.hpp>

//
#include <boost/date_time/gregorian/gregorian.hpp>



#include "singleton.h"
#include "daemonize.h"

int global_run_foverer=1;

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

void ctrlchandler(int) {
	printf("ctrlchandler\r\n");
	global_run_foverer=0;
}
void killhandler(int) {
	printf("killhandler\r\n");
	global_run_foverer=0;
}

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

long millis(void){
	boost::posix_time::ptime tick_back(boost::gregorian::date(1970,boost::gregorian::Jan,1));
	boost::posix_time::ptime tick_now = boost::posix_time::microsec_clock::universal_time();
	boost::posix_time::time_duration tick_diff;
	tick_diff = tick_now - tick_back;
	return tick_diff.total_milliseconds();
}

long micros(void){
	boost::posix_time::ptime tick_back(boost::gregorian::date(1970,boost::gregorian::Jan,1));
	boost::posix_time::ptime tick_now = boost::posix_time::microsec_clock::universal_time();
	boost::posix_time::time_duration tick_diff;
	tick_diff = tick_now - tick_back;
	return tick_diff.total_microseconds();
}

long nanos(void){
	boost::posix_time::ptime tick_back(boost::gregorian::date(1970,boost::gregorian::Jan,1));
	boost::posix_time::ptime tick_now = boost::posix_time::microsec_clock::universal_time();
	boost::posix_time::time_duration tick_diff;
	tick_diff = tick_now - tick_back;
	return tick_diff.total_nanoseconds();
}

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////



//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////



class PID {
public:
	/*working variables*/
	boost::posix_time::ptime lastTime;
	double Input, Output, Setpoint;
	double errSum, lastErr;
	double kp, ki, kd;

	//
	double autotune_ku;
	double autotune_pu;
	double autotune_input_back;
	double autotune_input_oscillation;

	PID(){
		//
		Input=0;
		Output=0;
		Setpoint=0;
		//
		lastTime = boost::posix_time::microsec_clock::local_time();
		errSum=0;
		lastErr=0;
		//
		kp=0;
		ki=0;
		kd=0;
		//
		autotune_ku=0;
		autotune_pu=0;
		autotune_input_back=Input;
	}



	void online_autotune(){

		autotune_input_oscillation=Input-autotune_input_back;

		//oscillation is not sufficient
		if(abs(autotune_input_oscillation)<1){
			//increase ku
			printf("ku=%.2f\r\n",autotune_ku);
			autotune_ku+=1;
		}
		//oscillation is ok
		else {
			//calcute tunning
			kp = 0.6*autotune_ku;
			ki = 2*kp/autotune_pu;
			kd = kp*autotune_pu/8.0f;
			printf("kp=%.2f ki=%.2f kd=%.2f\r\n",kp,ki,kd);
		}

	}

	void Compute(double input_now)
	{
		//
		autotune_input_back = Input;
		Input = input_now;
		online_autotune();


		/*How long since we last calculated*/
		boost::posix_time::ptime now = boost::posix_time::microsec_clock::local_time();
		boost::posix_time::time_duration tick_diff = now - lastTime;
		double timeChange = tick_diff.total_microseconds() / 1000000.0f;

		/*Compute all the working error variables*/
		double error = Setpoint - Input;
		errSum += (error * timeChange);
		double dErr = (error - lastErr) / timeChange;

		/*Compute PID Output*/
		Output = kp * error + ki * errSum + kd * dErr;

		/*Remember some variables for next time*/
		lastErr = error;
		lastTime = now;
	}

	/*
	void SetTunings(double Kp, double Ki, double Kd)
	{
		kp = Kp;
		ki = Ki;
		kd = Kd;
	}
	 */
};

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

boost::atomic<bool> motors_ready(false);

//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////

class vbat_t {
public:
	float vbat;
	float vdd0;
	float vdd1;
	float vdd2;
	float vdd3;
	float vdd4;
	float vdd0_setpoint;
	float vdd1_setpoint;
	float vdd2_setpoint;
	float vdd3_setpoint;
	float vdd4_setpoint;
} ;





float vbat_get(unsigned char channel,int fd)
{
	if(channel>9) return -1;
	unsigned lower = i2c_smbus_read_byte_data(fd, 0x34 + (channel<<1));
	unsigned upper = i2c_smbus_read_byte_data(fd, 0x33 + (channel<<1));
	unsigned value = upper<<2 | lower;
	//VREF Reference Voltage Internally connected to VDDC pin. 1.8V +/- 0.05V
	//Measured Input Scaling Factor External inputs ANA{0,1,2,3}  0.25  V/V  	ch 0-3
	//Measured Input Scaling Factor VDD{0,1,2,3,4} inputs 0.4  V/V 				ch 4-8
	//Measured Input Scaling Factor VINSYS input 0.25 V/V 						ch 9
	float factor;
	if(channel<4) factor=0.031;
	else if(channel<9) factor=1.8/0.4/1023;
	else factor=1.8/0.25/1023;
	float v = value * factor;
	//printf("Channel=%d Vbat=%.2fVolt RawValue=%d RawHiByte=0x%x RawLiByte=0x%x\n",(int)channel,v,value,upper,lower);
	return v;
}

int vbat_read(vbat_t *vbat,int fd)
{
	vbat->vbat=vbat_get(0,fd);
	vbat->vdd0=vbat_get(4,fd);
	vbat->vdd1=vbat_get(5,fd);
	vbat->vdd2=vbat_get(6,fd);
	vbat->vdd3=vbat_get(7,fd);
	vbat->vdd4=vbat_get(8,fd);
	return 0;
}

boost::atomic<vbat_t> atomic_vbat;
boost::atomic<bool> vbat_ready(false);

void thread_vbat(void){

	/*
	/dev/i2c-0
	0×49 Atmel AT73C246 Power Management and Analog Companions (PMAAC)
	0×50 24C32WI eeprom
	0x5d Bottom camera

	/dev/i2c-1
	 0×21 Horizontal Camera – OmniVision ov7725
	 */

	printf("vbat init!\r\n");
	const int VBAT_ADDRESS=0x49;


	int fd = open( "/dev/i2c-0", O_RDWR );

	if( ioctl( fd, I2C_SLAVE, VBAT_ADDRESS ) < 0 )
	{
		fprintf( stderr, "Failed to set slave address: %m\n" );
	}

	//ADC_CTRL
	if( i2c_smbus_write_byte_data( fd, 0x30, 0xc7))   {
		fprintf( stderr, "Failed to write to I2C device\n" );
	}
	//ADC_MUX_1
	if( i2c_smbus_write_byte_data( fd, 0x31, 0x5f)){
		fprintf( stderr, "Failed to write to I2C device\n" );
	}
	//ADC_MUX_2
	if( i2c_smbus_write_byte_data( fd, 0x32, 0x0f))  {
		fprintf( stderr, "Failed to write to I2C device\n" );
	}


	//Setpoint
	unsigned char v;
	vbat_t vbat;

	v = i2c_smbus_read_byte_data(fd, 0x06);
	vbat.vdd0_setpoint = (v&0x80 ? (v & 0x3f) * 0.05 + 0.80 : 0);

	v = i2c_smbus_read_byte_data(fd, 0x07);
	vbat.vdd1_setpoint = (v&0x80 ? (v & 0x3f) * 0.05 + 0.80 : 0);

	v = i2c_smbus_read_byte_data(fd, 0x08);
	vbat.vdd2_setpoint = (v&0x80 ? (v & 0x3f) * 0.05 + 0.80 : 0);

	v = i2c_smbus_read_byte_data(fd, 0x09);
	vbat.vdd3_setpoint = (v&0x80 ? (v & 0x3f) * 0.05 + 2.70 : 0);

	v = i2c_smbus_read_byte_data(fd, 0x0a);
	vbat.vdd4_setpoint = (v&0x80 ? (v & 0x3f) * 0.05 + 2.70 : 0);

	//printf("Setpoints %f %f %f %f\n",vbat->vdd0_setpoint,vbat->vdd1_setpoint,vbat->vdd2_setpoint,vbat->vdd3_setpoint);
	printf("vbat working!\r\n");
	while(global_run_foverer) {
		vbat_read(&vbat,fd);
		atomic_vbat = vbat;
		vbat_ready = true;
	}


}



void vbat_show(void){

	vbat_t vbat;

	while(!vbat_ready){
		boost::this_thread::sleep(boost::posix_time::milliseconds(16));
	}

	while(global_run_foverer){

		vbat = atomic_vbat;

		printf("set|%4.2f|%4.2f|%4.2f|%4.2f|%4.2f|\r\n",
				vbat.vdd0_setpoint,
				vbat.vdd1_setpoint,
				vbat.vdd2_setpoint,
				vbat.vdd3_setpoint,
				vbat.vdd4_setpoint);
		printf("get|%4.2f|%4.2f|%4.2f|%4.2f|%4.2f|%5.2f|\r\n",
				vbat.vdd0,
				vbat.vdd1,
				vbat.vdd2,
				vbat.vdd3,
				vbat.vdd4,
				vbat.vbat);
	}

}





//////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////

typedef struct {
	uint8_t buf[614400];
} camera_image_horizontal_t;

typedef struct {
	uint8_t buf[50688];
} camera_image_vertical_t;

boost::mutex camera_mutex_h;
boost::mutex camera_mutex_v;
camera_image_horizontal_t camera_img_h;
camera_image_vertical_t camera_img_v;

void camera_process_image(const void *p, int size)
{
	if(size==614400){
		boost::mutex::scoped_lock lock_h(camera_mutex_h, boost::try_to_lock);
		if(lock_h){
			memcpy(&camera_img_h.buf,p,size);
		} else {
			printf("fail to lock img_h\r\n");
		}
	}
	if(size==50688){
		boost::mutex::scoped_lock lock_v(camera_mutex_v, boost::try_to_lock);
		if(lock_v){
			memcpy(&camera_img_v.buf,p,size);
		} else {
			printf("fail to lock img_v\r\n");
		}
	}
}

///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////

typedef struct  {
	void   *start;
	size_t  length;
} camera_buffer_t;

typedef struct {
	char* dev_name;
	int width;
	int height;
	//////////////////////////
	int fd;
	camera_buffer_t *buffers;
	int n_buffers;
} camera_context_t;

int camera_xioctl(int fh, int request, void *arg,const char *name)
{
	int r = ioctl(fh, request, arg);
	if(r==-1){
		printf("ioctl fd=%d name=%s \033[1;31mFAIL\033[m\r\n",fh,name);
	} else {
		printf("ioctl fd=%d name=%s \033[1;32mOK\033[m\r\n",fh,name);
	}
	return r;
}


void camera_init(camera_context_t* ctx){

	///////////////////////////////////////////////////////////////////////////
	////////////////// ------ OPEN DEVICE

	//| O_NONBLOCK
	ctx->fd = open(ctx->dev_name, O_RDWR , 0);
	if(ctx->fd<0){
		printf("error cannot open device\r\n");
	}

	////////////////////////////////////////////////////////////////
	///////////////// ---------- DEVICE CAPS ----------------------

	struct v4l2_capability cap;
	memset(&cap,0,sizeof(cap));
	camera_xioctl(ctx->fd, VIDIOC_QUERYCAP, &cap,"VIDIOC_QUERYCAP");

	//////////////////////////////////////////////////////////////////////
	///////////////////--------- SET FORMAT

	struct v4l2_format fmt;
	memset(&fmt,0,sizeof(fmt));
	fmt.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
	fmt.fmt.pix.pixelformat = V4L2_PIX_FMT_YUV420;
	fmt.fmt.pix.width=ctx->width;
	fmt.fmt.pix.height=ctx->height;
	camera_xioctl(ctx->fd, VIDIOC_S_FMT, &fmt,"VIDIOC_S_FMT");

	/////////////////////////////////////////////////////////////////
	/////////////// ----------------  REQUEST BUFFER ---------///////

	struct v4l2_requestbuffers req;
	memset(&req,0,sizeof(req));
	req.count = 4;
	req.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
	req.memory = V4L2_MEMORY_MMAP;
	camera_xioctl(ctx->fd, VIDIOC_REQBUFS, &req,"VIDIOC_REQBUFS");

	/////////////////////////////////////////////////////////////////////////////
	////////////////--------------- MMAP INIT

	ctx->n_buffers=req.count;
	ctx->buffers = (camera_buffer_t*) calloc(ctx->n_buffers, sizeof(camera_buffer_t));

	for (int i = 0; i < ctx->n_buffers; ++i) {
		struct v4l2_buffer buf;
		memset(&buf,0,sizeof(buf));
		buf.type        = V4L2_BUF_TYPE_VIDEO_CAPTURE;
		buf.memory      = V4L2_MEMORY_MMAP;
		buf.index       = i;
		camera_xioctl(ctx->fd, VIDIOC_QUERYBUF, &buf,"VIDIOC_QUERYBUF");
		ctx->buffers[i].length = buf.length;
		ctx->buffers[i].start = mmap(NULL,buf.length,PROT_READ | PROT_WRITE ,MAP_SHARED, ctx->fd, buf.m.offset);
	}

	/////////////////////////////////////////////////////////////////////
	////////////---------------- enqueue request

	for (int i = 0; i < ctx->n_buffers; ++i) {

		struct v4l2_buffer buf;
		memset(&buf,0,sizeof(buf));

		buf.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
		buf.memory = V4L2_MEMORY_MMAP;
		buf.index = i;

		camera_xioctl(ctx->fd, VIDIOC_QBUF, &buf,"VIDIOC_QBUF");
	}

	/////////////////////////////////////////////////////////////////////
	////////////---------------- START CAPTURE

	enum v4l2_buf_type type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
	camera_xioctl(ctx->fd, VIDIOC_STREAMON, &type,"VIDIOC_STREAMON");
}

int camera_loop_check(camera_context_t* ctx){

	fd_set fds;
	struct timeval tv;
	int r;
	FD_ZERO(&fds);
	FD_SET(ctx->fd, &fds);
	/* Timeout. */
	tv.tv_sec = 2;
	tv.tv_usec = 0;

	r = select(ctx->fd + 1, &fds, NULL, NULL, &tv);

	if (-1 == r) {
		return -1;
	}

	if (0 == r) {
		return 0;
	}
	return 1;
}

void camera_loop_frame(camera_context_t* ctx){

	///////////////////////////////////////////////////
	////////////////////////////---------- DEQUEUE
	struct v4l2_buffer buf;
	memset(&buf,0,sizeof(buf));
	buf.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
	buf.memory = V4L2_MEMORY_MMAP;
	if(camera_xioctl(ctx->fd, VIDIOC_DQBUF, &buf,"VIDIOC_DQBUF")!=-1){
		////////////////////////////////////////////////--- USE
		camera_process_image(ctx->buffers[buf.index].start, buf.bytesused);
		//////////////////////////////////////////////----RE-ENQUEUE
		camera_xioctl(ctx->fd, VIDIOC_QBUF, &buf,"VIDIOC_QBUF");
	}

}



void camera_close(camera_context_t* ctx){

	////////////////////////////////////////////////////////////////////////
	//////////////////////////-------- STOP CAPTURE

	enum v4l2_buf_type type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
	camera_xioctl(ctx->fd, VIDIOC_STREAMOFF, &type,"VIDIOC_STREAMOFF");

	////////////////////////////////////////////////////////////////////////
	//////////////////////////-------- deinit mmap

	for (int i = 0; i < ctx->n_buffers; ++i){
		munmap(ctx->buffers[i].start, ctx->buffers[i].length);
	}
	free(ctx->buffers);

	////////////////////////////////////////////////////////////////////////
	//////////////////////////-------- CLOSE DEVICE

	close(ctx->fd);
}

void camera_h(void){
	camera_context_t ctx_h;
	ctx_h.dev_name = (char*)"/dev/video0";
	ctx_h.width=640;
	ctx_h.height=480;


	camera_init(&ctx_h);
	while(global_run_foverer){
		camera_loop_frame(&ctx_h);
	}
	camera_close(&ctx_h);

}

void camera_v(void){

	camera_context_t ctx_v;
	ctx_v.dev_name = (char*)"/dev/video1";
	ctx_v.width=176;
	ctx_v.height=144;

	camera_init(&ctx_v);
	while(global_run_foverer){
		camera_loop_frame(&ctx_v);
	}
	camera_close(&ctx_v);
}





//#pragma pack(push,1)
typedef struct
{
	uint16_t size;                // +0x00 Size of the following data (always 0x2C)
	uint16_t seq;                 // +0x02 Sequence number, increases every update
	uint16_t acc_x;              // +0x04 Raw data (10-bit) of the accelerometers multiplied by 4
	uint16_t acc_y;              // +0x04 Raw data (10-bit) of the accelerometers multiplied by 4
	uint16_t acc_z;              // +0x04 Raw data (10-bit) of the accelerometers multiplied by 4
	uint16_t gyro_x;             // +0x0A Raw data for the gyros, 12-bit A/D converted voltage of the gyros. X,Y=IDG, Z=Epson
	uint16_t gyro_y;             // +0x0A Raw data for the gyros, 12-bit A/D converted voltage of the gyros. X,Y=IDG, Z=Epson
	uint16_t gyro_z;             // +0x0A Raw data for the gyros, 12-bit A/D converted voltage of the gyros. X,Y=IDG, Z=Epson
	uint16_t gyro_110_x;         // +0x10 4.5x Raw data (IDG), gyro values with another resolution (see IDG-500 datasheet)
	uint16_t gyro_110_y;         // +0x10 4.5x Raw data (IDG), gyro values with another resolution (see IDG-500 datasheet)
	uint16_t acc_temp;            // +0x14 Accs temperature -- startup value 120 @ 25C, rising to 143
	uint16_t gyro_temp;           // +0x16 XYGyro temperature (IDG), 12-bit A/D converted voltage of IDG's temperature sensor -- startup value 1532 @ 25C, rising to 1572
	uint16_t vrefEpson;           // +0x18 ZGyro v_ref (Epson), 12-bit A/D converted reference voltage of the Epson sensor
	uint16_t vrefIDG;             // +0x1A XYGyro v_ref (IDG), 12-bit A/D converted reference voltage of the IDG sensor
	uint16_t us_echo;             // +0x1C bit15=1 echo pulse transmitted, bit14-0 first echo. Value 30 = 1cm. min value: 784 = 26cm
	uint16_t checksum;            // +0x1E Checksum = sum of all values except checksum (22 values)
	uint16_t us_echo_start;       // +0x20 Array with starts of echos (8 array values @ 25Hz, 9 values @ 22.22Hz)
	uint16_t us_echo_end;         // +0x22 Array with ends of echos   (8 array values @ 25Hz, 9 values @ 22.22Hz)
	uint16_t us_association_echo; // +0x24 Ultrasonic parameter -- echo number starting with 0. max value 3758. examples: 0,1,2,3,4,5,6,7  ; 0,1,2,3,4,86,6,9
	uint16_t us_distance_echo;    // +0x26 Ultrasonic parameter -- no clear pattern
	uint16_t us_courbe_temps;     // +0x28 Ultrasonic parameter -- counts up from 0 to approx 24346 in 192 sample cycles of which 12 cylces have value 0
	uint16_t us_courbe_valeur;    // +0x2A Ultrasonic parameter -- value between 0 and 4000, no clear pattern. 192 sample cycles of which 12 cylces have value 0
	uint16_t us_courbe_ref;       // +0x2C Ultrasonic parameter -- coutns down from 4000 to 0 in 192 sample cycles of which 12 cylces have value 0
	uint16_t uk01;
	uint16_t uk02;
} navboard_packet_t;
//#pragma pack(pop)


class navboard_fusion_t {
public:


	double acc_x;
	double acc_y;
	double acc_z;

	double gyro_x;
	double gyro_y;
	double gyro_z;

	double gyro_x_dt;
	double gyro_y_dt;
	double gyro_z_dt;

	double gyro_x_integrate;
	double gyro_y_integrate;
	double gyro_z_integrate;

	double acc_pitch;
	double acc_roll;

	double fusion_pitch;
	double fusion_roll;
	double fusion_yaw;

	double height;

	double dt;
	double seq;

};

class navboard_calibration_t {
public:
	double acc_x_offset;
	double acc_y_offset;
	double acc_z_offset;
	double gyro_x_offset;
	double gyro_y_offset;
	double gyro_z_offset;
} ;

class motor_set_speed_t {
public:
	motor_set_speed_t(){
		front_left=0;
		front_right=0;
		rear_left=0;
		rear_right=0;
	}
	int16_t front_left;
	int16_t front_right;
